In [1]:
import pandas as pd

In [50]:
stock = [{'bikes': 10, 'pants': 28, 'watches': 10}, {'bikes': 12, 'pants': 24, 'watches': 8, 'glasses': 50}]
df = pd.DataFrame(stock, index=['Store 1', 'Store 2'])
df

         bikes  pants  watches  glasses
Store 1     10     28       10      NaN
Store 2     12     24        8     50.0

In [51]:
# return just the bikes column
df[['bikes']]

         bikes
Store 1     10
Store 2     12

In [52]:
# return both the bikes and watches
df[['bikes', 'watches']]

         bikes  watches
Store 1     10       10
Store 2     12        8

In [53]:
# get row for store 1 only
df.loc[['Store 1']]

         bikes  pants  watches  glasses
Store 1     10     28       10      NaN

In [54]:
# specific row / col value
# NOTE the column lable is first, then the row
df['bikes']['Store 2']

12

In [55]:
# add a mew column for 'shirts' like so
df['shirts'] = [4,8] 
df

         bikes  pants  watches  glasses  shirts
Store 1     10     28       10      NaN       4
Store 2     12     24        8     50.0       8

In [56]:
# create a new column using artithmetic e.g. a new suits col
df['suits'] = df['pants'] + df['shirts']
df

         bikes  pants  watches  glasses  shirts  suits
Store 1     10     28       10      NaN       4     32
Store 2     12     24        8     50.0       8     32

In [57]:
# to add a new row (i.e. a new store) to the data frame we need to create a new data frame first
items = [{'bikes': 2, 'pants': 5, 'watches': 8, 'shirts': 9, 'ties': 6}]
store3df = pd.DataFrame(items, index=['Store 3'])
store3df

         bikes  pants  watches  shirts  ties
Store 3      2      5        8       9     6

In [58]:
# now use the append() method on the orignal stores df
df = df.append(store3df)
df

         bikes  pants  watches  glasses  shirts  suits  ties
Store 1     10     28       10      NaN       4   32.0   NaN
Store 2     12     24        8     50.0       8   32.0   NaN
Store 3      2      5        8      NaN       9    NaN   6.0

In [59]:
# add a new column based on existing columns for specific rows
df['new_watches'] = df['watches'][1:]
df

         bikes  pants  watches  glasses  shirts  suits  ties  new_watches
Store 1     10     28       10      NaN       4   32.0   NaN          NaN
Store 2     12     24        8     50.0       8   32.0   NaN          8.0
Store 3      2      5        8      NaN       9    NaN   6.0          8.0

In [60]:
# using insert() method to insert a column at a specific positon
df.insert(5, 'shoes', [8,5,4])
df

,bikes,pants,watches,glasses,shirts,shoes,suits,ties,new_watches
Store 1,10,28,10,NaN,4,8,32.0,NaN,NaN
Store 2,12,24,8,50.0,8,5,32.0,NaN,8.0
Store 3,2,5,8,NaN,9,4,NaN,6.0,8.0

In [61]:
# Delete columns using the pop() method
df.pop('new_watches')
df

         bikes  pants  watches  glasses  shirts  shoes  suits  ties
Store 1     10     28       10      NaN       4      8   32.0   NaN
Store 2     12     24        8     50.0       8      5   32.0   NaN
Store 3      2      5        8      NaN       9      4    NaN   6.0

In [62]:
# use drop() method to remove multiple colums
df = df.drop(['glasses', 'shirts'], axis=1)

In [63]:
# use drop() method to remove rows
df = df.drop(['Store 2', 'Store 3'], axis=0)

In [64]:
# use rename() function to rename colums
df = df.rename(columns={'bikes': 'bicyles'})
df

         bicyles  pants  watches  shoes  suits  ties
Store 1       10     28       10      8   32.0   NaN

In [66]:
# use rename() function to rename rows
df = df.rename(index={'Store 1': 'Last Store'})
df

            bicyles  pants  watches  shoes  suits  ties
Last Store       10     28       10      8   32.0   NaN

In [67]:
# set the index to one of the colums
df = df.set_index('pants')
df

       bicyles  watches  shoes  suits  ties
pants
28          10       10      8   32.0   NaN